Repository: Johnmontoya/Library-AspNet-Backend-2024
Catalog: Resources/SharedResource.*.resx
Languages: es_es

# AccountActivated
source: The account {0} has been activated
es_es: La cuenta {0} ha sido activada

# AccountBlocked
source: The user {0} has been blocked until
es_es: El usuario {0} ha sido bloqueado hasta

# AccountDeactivated
source: The {0} account is deactivated
es_es: La cuenta {0} ha sido inhabilitada

# Deleted
source: Deleted {0}
es_es: {0} eliminado

# Duplicate
source: A record with that {0} already exists
es_es: Un registro con ese {0} ya existe

# DuplicateEmail
source: A user already exists with the email {0}
es_es: Ya existe un usuario con el email {0}

# DuplicateUserName
source: A user with the name {0} already exists
es_es: Ya existe un usuario con el nombre {0}

# EmailConfirm
source: Confirmed email
es_es: Email confirmado

# EmailNotConfirm
source: The email {0} has not been confirmed
es_es: El email {0} no ha sido confirmado

# ErrorPassword
source: Error changing password
es_es: Error cambiado la contraseña

# ErrorRequest
source: There was a problem with the application
es_es: Hubo un problema en la solicitud

# ErrorServerEmail
source: An error has occurred with the email service provider
es_es: Ha ocurrido un error con el proveedor del servicio de correo

# GreaterThan
source: The field {0} cannot be less than {1}
es_es: El campo {0} no puede ser menor que {1}

# InvalidEmail
source: {0}'s email format is invalid
es_es: El formato del email {0} es invalido

# InvalidUserName
source: The username cannot have spaces or special characters
es_es: El nombre de usuario no puede tener espacios ni carácteres especiales

# LessThan
source: The field {0} cannot be greater than {1}
es_es: El campo {0} no puede ser mayor que {1}

# LinkSendAccount
source: We have sent an email with a link to reactivate your account
es_es: Hemos enviado un email con un link para reactivar su cuenta

# LinkSendEmail
source: We have sent a confirmation link to your email
es_es: Hemos enviado un link de confirmacion a su correo

# LinkSendOTP
source: We have sent an email with an OTP for validation
es_es: Hemos enviado un email con un OTP para la validación

# LinkSendPassword
source: We have sent an email with a link to proceed with the password change
es_es: Hemos enviado un email con un link para proceder con el cambio de contraseña

# NotEmpty
source: Field can't be empty
es_es: El campo {0} no puede estar vacio

# NotFound
source: Record not found
es_es: Registro no encontrado

# NotFoundSpecific
source: {0} not found
es_es: {0} no encontrado

# NotNull
source: Field can't be null
es_es: El campo {0} no puede ser nulo

# OTPInvalid
source: Incorrect OTP
es_es: OTP Invalido

source: OTP Success
es_es: OTP verificado correctamente

# PasswordRequiresDigit
source: Password must have at least one number
es_es: La contraseña debe tener al menos un número

# PasswordRequiresNonAlphanumeric
source: The password must have at least one non-alphanumeric character
es_es: La contraseña debe tener al menos un carácter no alfanumerico

# PasswordRequiresUpper
source: Password must have at least one uppercase letter
es_es: La contraseña debe tener al menos una letra mayúscula

# PasswordSuccess
source: The password has been changed
es_es: La contraseña ha sido cambiada

# PasswordTooShort
source: The password is too short
es_es: La contraseña es demasiado corta

# ProfileAlready
source: The data has already been recorded
es_es: Los datos ya han sido registrados

# ProfileInfo
source: Register the following data to view your information
es_es: Registre los siguientes datos para ver su información

# ProfileSaved
source: Saved personal data
es_es: Datos personales {0}

# Success
source: Saved {0}
es_es: {0} guardado

# Unauthorized
source: Unauthorized user
es_es: Usuario no autorizado

# Updated
source: Updated {0}
es_es: {0} actualizado

# UserPassInvalid
source: Incorrect username or password
es_es: Usuario o Contraseña invalida

# UserTokenInvalid
source: Incorrect user or token
es_es: Token o usuario invalido

# Welcome
source: Welcome {0}
es_es: Bienvenido {0}
